docs/vocabulary_development/auto-generated/md/definition-files/MechanicalModel.md
```mermaid
classDiagram
ModelType <|-- DrillStemMechanicalModel
DWISNoun <|-- MechanicalStiffnessType
MechanicalStiffnessType <|-- MechanicalSoftModel
MechanicalStiffnessType <|-- MechanicalStiffModel
MechanicalStiffModel <|-- MechanicalStiffModelAssumedContacts
MechanicalStiffModel <|-- MechanicalStiffModelEstimatedContacts
DWISNoun <|-- TangencyLength
```
